app/views/users/usermanage.html.erb

SELECT "users".* FROM "users"
---
    <tbody>
      <% User.all.each do |user| %>