app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def index
    if !session[:user_id]
        flash[:login_errors] = 'User Not Logged-In. Please Log-In/Register'
        redirect_to '/'
    end
    @companies = Company.all