app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["title", "My Post"], ["content", "This is a test post"], ["created_at", "2023-03-08 01:23:46.837730"], ["updated_at", "2023-03-08 01:23:46.837730"], ["image", "test_image1.jfif"]]
---
    def create
      @post = Post.new(post_params)
      if @post.save