app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alice@example.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
      user = User.find_by(email:user_params[:email])
      if user
        flash[:login_errors] = 'User already exists. Please Login.'
        redirect_to '/'
      else
        user = User.new(user_params)
        if user.save